In [4]:
import pandas as pd
import numpy as np
import os

In [5]:
!pip install pandas 
!pip install numpy

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.0.1)
Requirement already satisfied: numpy>=1.13.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.18.1)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)
Requirement already satisfied: numpy in c:\programdata\anaconda3\lib\site-packages (1.18.1)

In [26]:
#Write a Pandas program to print a concise summary of the dataset. Hint: Info
col1_Names=['Survived','Pclass','Name','Sex','Age','Siblings/Spouses Aboard','Parents/Children Aboard','Fare']

titanic = pd.read_csv(r'C:\Users\james\Documents\Jupyter assignment\test13\titanic.csv')
#,
#sep=",", header=None,names = col1_Names)
titanic.head(10)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
5,0,3,Mr. James Moran,male,27.0,0,0,8.4583
6,0,1,Mr. Timothy J McCarthy,male,54.0,0,0,51.8625
7,0,3,Master. Gosta Leonard Palsson,male,2.0,3,1,21.0750
8,1,3,Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson,female,27.0,0,2,11.1333
9,1,2,Mrs. Nicholas (Adele Achem) Nasser,female,14.0,1,0,30.0708

In [28]:
#Write a Pandas program to extract the column labels, shape and data types of the dataset'''
print("List of columns:")
print(titanic.columns)
print("\nShape of the Dataset:")
print(titanic.shape)
print("\nData types of the Dataset:")
print(titanic.dtypes)

List of columns:
Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Siblings/Spouses Aboard',
       'Parents/Children Aboard', 'Fare'],
      dtype='object')

Shape of the Dataset:
(887, 8)

Data types of the Dataset:
Survived                     int64
Pclass                       int64
Name                        object
Sex                         object
Age                        float64
Siblings/Spouses Aboard      int64
Parents/Children Aboard      int64
Fare                       float64
dtype: object

In [29]:
#Write a Pandas program to create a Pivot table with the following indexes from the data set of titanic.csv
#a. Sex - age
result = pd.pivot_table(titanic, index = ["Sex","Age"], aggfunc=np.sum)
print(result)

                  Fare  Parents/Children Aboard  Pclass  \
Sex    Age
female 0.75    38.5166                        2       6
       1.00    26.8750                        3       6
       2.00   281.8333                       10      18
       3.00    88.1209                        4       8
       4.00   114.1417                        6      13
...                ...                      ...     ...
male   70.00   81.5000                        1       3
       70.50    7.7500                        0       3
       71.00   84.1584                        0       2
       74.00    7.7750                        0       3
       80.00   30.0000                        0       1

              Siblings/Spouses Aboard  Survived
Sex    Age
female 0.75                         4         2
       1.00                         1         2
       2.00                        10         3
       3.00                         7         1
       4.00                         4         5
...                               ...       ...
male   70.00                        1         0
       70.50                        0         0
       71.00                        0         0
       74.00                        0         0
       80.00                        0         1

[149 rows x 5 columns]

In [30]:
#b. Sex - Pclass
result = pd.pivot_table(titanic, index = ["Sex","Pclass"], aggfunc=np.sum)
#result.head()
print(result)

                   Age       Fare  Parents/Children Aboard  \
Sex    Pclass
female 1       3314.00  9975.8250                       43
       2       2202.50  1669.7292                       46
       3       3187.50  2321.1086                      115
male   1       5064.42  8201.5875                       34
       2       3293.33  2132.1125                       24
       3       9079.42  4354.5449                       78

               Siblings/Spouses Aboard  Survived
Sex    Pclass
female 1                            52        91
       2                            37        70
       3                           129        72
male   1                            38        45
       2                            37        17
       3                           173        47

In [31]:
#c. Sex â€“ survived
result = pd.pivot_table(titanic, index = ["Sex","Survived"], aggfunc=np.sum)
print(result)

                      Age        Fare  Parents/Children Aboard  Pclass  \
Sex    Survived
female 0          1978.00   1864.9752                       84     231
       1          6726.00  12101.6876                      120     447
male   0         14447.50  10238.7031                       97    1147
       1          2989.67   4449.5418                       39     220

                 Siblings/Spouses Aboard
Sex    Survived
female 0                              98
       1                             120
male   0                             206
       1                              42

In [32]:
#Write a Pandas program to partition each of the passengers into four categories based on their age
cat = pd.cut(titanic['Age'], [0, 10, 30, 60, 80])
print(cat)

0      (10, 30]
1      (30, 60]
2      (10, 30]
3      (30, 60]
4      (30, 60]
         ...
882    (10, 30]
883    (10, 30]
884     (0, 10]
885    (10, 30]
886    (30, 60]
Name: Age, Length: 887, dtype: category
Categories (4, interval[int64]): [(0, 10] < (10, 30] < (30, 60] < (60, 80]]

In [40]:
#Write a Pandas program to create a Pivot table and find number of
'''
a. adult male, adult female

b. Male and female children

c. Children are any group < =18 age '''

mf = titanic[titanic['Age'] > 18].groupby('Sex')['Siblings/Spouses Aboard','Parents/Children Aboard']
print(mf.count())

        Siblings/Spouses Aboard  Parents/Children Aboard
Sex
female                      234                      234
male                        487                      487

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:9: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  if __name__ == '__main__':